FKDD_COPY_DIFF_3_2026-02-14/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>Контрагенты и контакты</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Comment>Вид контрагента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСобственности</Name>
					<Comment>Форма собственности контрагента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыСобственности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Указывается для внутренних контрагентов ( подотчетных лиц )</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Ссылка на организацию для собственных филиалов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Comment>Код ОКПО контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИМНС</Name>
					<Comment>Код ИМНС контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>Банковский счет контрагента, используемый по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Дополнительная информация о контрагенте</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>График работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсвобожденОтНДС</Name>
					<Comment>Если флажок установлен, то при заполнении приходных документов от этого контрагента, товары будут поступать без НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Comment>Рекламный источник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения контактного лица</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеньРождения</Name>
					<Comment>Месяц и число дня рождения сотрудника для сортировки списка по дням рождения. Формируется автоматически от даты рождения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Пол контактного лица</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, создавший запись о контрагенте</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Дата регистрации</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПерсональныхДанных</Name>
					<Comment>Согласие на обработку персональных данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтветов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПерсональныхДанныхДата</Name>
					<Comment>Дата согласия на обработку персональных данных</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Имя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Comment>Отчество</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедушийКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтношений</Name>
					<Comment>Вид отношений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаимоотношений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойТелефон</Name>
					<Comment>Основной телефон контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпПользовательДляПереключенияЗвонков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUIDСайта</Name>
					<Comment>GUIDСайта автосервиса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьАвтомобилиИЗаказНарядыНаСайт</Name>
					<Comment>Выгружать автомобили и заказ-наряды на сайт</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаПолучениеSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапыРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛизинговаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражанство</Name>
					<Comment>Гражанство контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DN_НоменклатураКСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DN_СтатьяДоходовКСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DN_СтатьяРасходовКСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DN_СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Comment>Гражданство</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ПризнакЛояльности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_ПризнакиЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийОповестить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перекуп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтрНеАктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ОтказОтКоммуникации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БТ_КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Comment>Вид контактной информации</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Строковое представление контактной информации</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/CommonModules/DN_HTTP_Обмен/Ext/Module.bsl
Функция ОбработкаМетодовPOST(СтруктураВхПараметров,ТипДанных) Экспорт 
	
	СтруктураОтвет = Новый Структура("ДанныеОтвета,Отработало,ТекстОшибки,КодОтвета","",Истина,"",200);
	
	Если ТипДанных = "УИД" тогда
		ОтправитьПоУИДу(СтруктураОтвет,СтруктураВхПараметров);
	ИначеЕсли ТипДанных = "Наименование" тогда
		ОтправитьНаименование(СтруктураОтвет,СтруктураВхПараметров)
	Иначе
	    ВходОбъект = Метаданные[ТипДанных];
			
		Если ВРег(ТипДанных) = ВРег("Документы") или ВРег(ТипДанных) = ВРег("Справочники") Тогда 
			РаботаемСДокСпр(СтруктураОтвет,СтруктураВхПараметров,ВходОбъект);
		Иначе
			ЗаполнитьСтруктуруОтвета(СтруктураОтвет,405,"Отсутствует Метод " + ?(СтруктураВхПараметров.ИмяМетода=Неопределено,"",СтруктураВхПараметров.ИмяМетода),ложь,"");
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СтруктураОтвет;  
	
КонецФункции  

Процедура РаботаемСДокСпр(СтруктураОтвет,СтруктураВхПараметров,ВходОбъект)
	
	//Сначало ищем по УИДу
	УИД = Новый УникальныйИдентификатор(СтруктураВхПараметров.УИД);
	Менеджер = Новый(СтрЗаменить(ВходОбъект[СтруктураВхПараметров.ЗначениеОбъекта].ПолноеИмя(), ".","Менеджер."));
	Ссылка = Менеджер.ПолучитьСсылку(УИД);	
	Объект = Ссылка.ПолучитьОбъект();                                          
		
	Если Объект = Неопределено тогда
		Если ВходОбъект = Метаданные.Справочники тогда 
			Если СтруктураВхПараметров.Свойство("ЭтоГруппа") и СтруктураВхПараметров.ЭтоГруппа тогда  
				НайденнаяСсылка = Менеджер.НайтиПоНаименованию(СтруктураВхПараметров.Наименование);
				Если НЕ ЗначениеЗаполнено(НайденнаяСсылка) тогда
					Объект = Менеджер.СоздатьГруппу(); 
					Объект.УстановитьСсылкуНового(Ссылка);
				Иначе
					Объект = НайденнаяСсылка.ПолучитьОбъект();
				КонецЕсли;
			Иначе             
				Объект = Менеджер.СоздатьЭлемент();	      
				Объект.УстановитьСсылкуНового(Ссылка);
			КонецЕсли
		ИначеЕсли ВходОбъект = Метаданные.Документы тогда
			Объект = Менеджер.СоздатьДокумент();		
			Объект.УстановитьСсылкуНового(Ссылка);
		КонецЕсли;		                                  	
	КонецЕсли;
		
	ЗаполненыйОбъект = ЗаполнитьОбъект(Объект,СтруктураВхПараметров);

	//////////////////////////////////////////////
	//Переносим табл части
	Если СтруктураВхПараметров.Свойство("ЭтоГруппа") и НЕ СтруктураВхПараметров.ЭтоГруппа тогда 
		Для Каждого ТаблЧасть Из ЗаполненыйОбъект.Метаданные().ТабличныеЧасти Цикл
			ИмяТабл = ТаблЧасть.Имя + "_ТаблЧасть";
			Если СтруктураВхПараметров.Свойство(ИмяТабл) тогда  
				СтруктураТЧ = СтруктураВхПараметров[ИмяТабл]; 		
				ТЧОбъекта = ЗаполненыйОбъект[ТаблЧасть.Имя];	
				ЗаполненыйОбъект = ЗаполнитьТЧОбъекта(ЗаполненыйОбъект,СтруктураТЧ,ТЧОбъекта);		
			КонецЕсли;
		КонецЦикла;   
	КонецЕсли;

	Если НЕ ЗаполненыйОбъект = Неопределено тогда     
				
		Если ВходОбъект = Метаданные.Документы тогда
			Попытка
				ЗаполненыйОбъект.ОбменДанными.Загрузка = Истина;
				ЗаполненыйОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Попытка
					ЗаполненыйОбъект.ОбменДанными.Загрузка = Истина;
					ЗаполненыйОбъект.Записать(РежимЗаписиДокумента.Запись);	
				Исключение
					ЗаполненыйОбъект.УстановитьНовыйНомер();
					ЗаполненыйОбъект.ОбменДанными.Загрузка = Истина;
					ЗаполненыйОбъект.Записать(РежимЗаписиДокумента.Запись);					
				КонецПопытки;
			КонецПопытки;
		Иначе
			Попытка
				ЗаполненыйОбъект.ОбменДанными.Загрузка = Истина;
				ЗаполненыйОбъект.Записать();
			Исключение
				ЗаполненыйОбъект.ОбменДанными.Загрузка = Истина;
				ЗаполненыйОбъект.УстановитьНовыйНомер();
				ЗаполненыйОбъект.Записать();			        
			КонецПопытки;
			//////////////////////////////////////////////
			//Переносим регистр контактной информации
			ИмяРегистра = "КонтактнаяИнформация_РегистрСвед";
			Если СтруктураВхПараметров.Свойство(ИмяРегистра) тогда
				ЗаполнитьРегистр(ЗаполненыйОбъект.Ссылка,СтруктураВхПараметров.КонтактнаяИнформация_РегистрСвед);		
			КонецЕсли;
			//////////////////////////////////////////////	
		КонецЕсли; 
		
	Иначе 
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,405,"Отсутствует Метод " + ?(СтруктураВхПараметров.ИмяМетода=Неопределено,"",СтруктураВхПараметров.ИмяМетода),ложь,"");
	КонецЕсли;
				
КонецПроцедуры  

Процедура ПередатьПодтверждающиеДокументы(ВходСсылка)
    	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодтверждающиеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВходСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Ссылка = Выборка.Ссылка;
		УИД = Ссылка.УникальныйИдентификатор();
		Отправлен = ОтправитьОбъект(Ссылка,УИД);
	КонецЦикла;
	
КонецПроцедуры          

Функция ЗаполнитьТЧОбъекта(Объект,СтруктураТЧ,ТЧОбъекта)
	
	ТЧОбъекта.Очистить();
	ТЧ = ТЧОбъекта.Выгрузить();
	КоличествоСтрок = СтруктураТЧ.КоличествоСтрок;
	Если КоличествоСтрок > 0 тогда
		Строка = 0;
		Пока Строка < КоличествоСтрок Цикл
			НоваяСтрока = ТЧ.Добавить();
			Для Каждого Колонка из ТЧ.Колонки Цикл
				Если НЕ Колонка.Имя = "НомерСтроки" тогда
					Ключ = Строка(Колонка.Имя) + "__" + Строка(Строка);
					Если СтруктураТЧ.Свойство(Ключ) тогда
						ВхЗначение = СтруктураТЧ[Ключ];
						ЗначениеТЧ = Декодировать(ВхЗначение);
						Если ЗначениеТЧ = "ОТКАЗ" тогда
							Возврат Неопределено;
						КонецЕсли;
						НоваяСтрока[Колонка.Имя] = ЗначениеТЧ;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;			
			Строка = Строка + 1;	              			
		КонецЦикла;
			
		ТЧОбъекта.Загрузить(ТЧ);
	КонецЕсли;		
	Возврат Объект;
	
КонецФункции //ЗаполнитьТЧОбъекта 

Процедура ЗаполнитьРегистр(Ссылка,СтруктураРегистра)

	НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	КоличествоСтрок = СтруктураРегистра.КоличествоСтрок;
	Если КоличествоСтрок > 0 тогда
		Строка = 0;
		Пока Строка < КоличествоСтрок Цикл
			Запись = НаборЗаписей.Добавить();
			Для Каждого ВходЗначение из СтруктураРегистра Цикл 
				Строки = СтрЗаменить(ВходЗначение.Ключ,"__", Символы.ПС);
				Ключ = СтрПолучитьСтроку(Строки, 1); 
				НомерСтроки = СтрПолучитьСтроку(Строки, 2); 
				Если НЕ ЗначениеЗаполнено(НомерСтроки) тогда
					Продолжить;
				КонецЕсли;
				
				НомерСтроки = Число(НомерСтроки);
				Если НомерСтроки = Строка тогда
                    ЗначениеРег = Декодировать(ВходЗначение.Значение);
					Если ЗначениеРег = "ОТКАЗ" тогда
						Продолжить;
					КонецЕсли;					
					Попытка
						Запись[Ключ] = ЗначениеРег;							
					Исключение			
					КонецПопытки;										
				КонецЕсли;
			КонецЦикла;			
			Строка = Строка + 1;	              							
		КонецЦикла;
		НаборЗаписей.Записать();	
	КонецЕсли;

КонецПроцедуры     

Функция Декодировать(Значение)

	Если ТипЗнч(Значение) = Тип("Строка") тогда
							
		Если Лев(Значение,6) = "ДАТА__" тогда
			Строки = СтрЗаменить(Значение,"__", Символы.ПС);
			ДатаСтрокой = СтрПолучитьСтроку(Строки, 2);
			Значение = Дата(ДатаСтрокой);
			Возврат Значение; 
		ИначеЕсли Значение = "НЕОПРЕДЕЛЕНО" тогда
			Значение = Неопределено;	
			Возврат Значение; 
		ИначеЕсли Значение = "NULL" тогда
			Значение = NULL;
			Возврат Значение; 
		КонецЕсли;
		
		Если СтрЧислоВхождений(Значение,"__") = 2 тогда
			Строки = СтрЗаменить(Значение,"__", Символы.ПС);
			ТипДанных = СтрПолучитьСтроку(Строки, 1);
											
			Если ВРег(ТипДанных) = ВРег("Перечисления") тогда
				ВходОбъект = Метаданные[ТипДанных];
				ТипДанных = СтрПолучитьСтроку(Строки, 1);
				ТипПеречисленияСтрокой = СтрПолучитьСтроку(Строки, 2);
				ЗнчПеречисленияСтрокой = СтрПолучитьСтроку(Строки, 3);
				
				ВходОбъект = Метаданные[ТипДанных];
				ТипПеречисления = ВходОбъект[ТипПеречисленияСтрокой];
				Для Каждого ТекЗначение из ТипПеречисления.ЗначенияПеречисления Цикл
					Если ТекЗначение.Имя = ЗнчПеречисленияСтрокой тогда
						Перечисление =  Перечисления[ТипПеречисленияСтрокой][ТекЗначение.Имя];
						Прервать;
					КонецЕсли;
				КонецЦикла;	
				
				Возврат Перечисление; 
				
			ИначеЕсли ВРег(ТипДанных) = ВРег("Документы") или ВРег(ТипДанных) = ВРег("Справочники") Тогда
				ВходОбъект = Метаданные[ТипДанных];
				ЗначениеОбъекта = СтрПолучитьСтроку(Строки, 2);
				Менеджер = Новый(СтрЗаменить(ВходОбъект[ЗначениеОбъекта].ПолноеИмя(), ".","Менеджер."));
				СтрокаУИД = СтрПолучитьСтроку(Строки, 3); 
				УИД = Новый УникальныйИдентификатор(СтрокаУИД);									
				
				Ссылка = Менеджер.ПолучитьСсылку(УИД);
				ЕстьСсылка = Ссылка.ПолучитьОбъект();
				
				Если ЕстьСсылка = Неопределено тогда
					///////////////////////////////////////////////////
					Если ВРег(ТипДанных) = ВРег("Документы") тогда
						Запросить = Истина;
					Иначе
					///////////////////////////////////////////////////	
						НаименованиеСправочника = ЗапроситьПараметр(ТипДанных,ЗначениеОбъекта,СтрокаУИД,"Наименование");
						
						Если НЕ НаименованиеСправочника = Неопределено тогда
                        	НайденнаяСсылка = Менеджер.НайтиПоНаименованию(НаименованиеСправочника);
							
							Если ЗначениеЗаполнено(НайденнаяСсылка) тогда
								Запросить = Ложь;
								Возврат НайденнаяСсылка;
							Иначе
								Запросить = Истина;
					    	КонецЕсли;
						КонецЕсли;    											
					КонецЕсли;
					///////////////////////////////////////////////////
					Если Запросить тогда																			
						Ответ = ЗапроситьДанныеУИсточника(ТипДанных,ЗначениеОбъекта,СтрокаУИД);
						Если Ответ тогда
							Ссылка =  Менеджер.ПолучитьСсылку(УИД);
							Возврат Ссылка;
						Иначе
							Возврат "ОТКАЗ";	
						КонецЕсли; 		
					КонецЕсли;
				Иначе
					Возврат Ссылка;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;	           						
	КонецЕсли;  
	
	Возврат Значение;

КонецФункции // Декодировать()

Функция ЗаполнитьОбъект(Объект,СтруктураВхПараметров)  
			
	Для Каждого ЗНЧСтурктуры из СтруктураВхПараметров Цикл
					
		Если НЕ ЗНЧСтурктуры.Ключ = "ЗначениеОбъекта" и ЕстьРеквизитОбъекта(ЗНЧСтурктуры.Ключ,Объект) тогда
			Если НЕ ЗНЧСтурктуры.Ключ = "УИД" тогда
				Если НЕ ЗНЧСтурктуры.Ключ = "ЭтоГруппа" тогда
					Если НЕ ЗНЧСтурктуры.Ключ = "НЕИЗВЕСТНЫЙ" тогда	
						Если НЕ ЗНЧСтурктуры.Ключ = "СтруктураТЧ" тогда	
							Значение = ЗНЧСтурктуры.Значение;
							
							Если ТипЗнч(Значение) = Тип("Строка") тогда
								
								Если Лев(Значение,6) = "ДАТА__" тогда
									Строки = СтрЗаменить(Значение,"__", Символы.ПС);
									ДатаСтрокой = СтрПолучитьСтроку(Строки, 2);
									Значение = Дата(ДатаСтрокой);	
								ИначеЕсли Значение = "НЕОПРЕДЕЛЕНО" тогда
									Значение = Неопределено;	
								ИначеЕсли Значение = "NULL" тогда
									Значение = NULL;
								КонецЕсли;
								
								Если СтрЧислоВхождений(Значение,"__") = 2 тогда
									Строки = СтрЗаменить(Значение,"__", Символы.ПС);
									ТипДанных = СтрПолучитьСтроку(Строки, 1);
																	
									Если ВРег(ТипДанных) = ВРег("Перечисления") тогда
										ВходОбъект = Метаданные[ТипДанных];
										ТипДанных = СтрПолучитьСтроку(Строки, 1);
										ТипПеречисленияСтрокой = СтрПолучитьСтроку(Строки, 2);
										ЗнчПеречисленияСтрокой = СтрПолучитьСтроку(Строки, 3);
										
										ВходОбъект = Метаданные[ТипДанных];
										ТипПеречисления = ВходОбъект[ТипПеречисленияСтрокой];
										Для Каждого ТекЗначение из ТипПеречисления.ЗначенияПеречисления Цикл
											Если ТекЗначение.Имя = ЗнчПеречисленияСтрокой тогда
												Значение =  Перечисления[ТипПеречисленияСтрокой][ТекЗначение.Имя];
												Прервать;
											КонецЕсли;
										КонецЦикла;	
										
									ИначеЕсли ВРег(ТипДанных) = ВРег("Документы") или ВРег(ТипДанных) = ВРег("Справочники") Тогда
										ВходОбъект = Метаданные[ТипДанных];
										ЗначениеОбъекта = СтрПолучитьСтроку(Строки, 2);
										Менеджер = Новый(СтрЗаменить(ВходОбъект[ЗначениеОбъекта].ПолноеИмя(), ".","Менеджер."));
										СтрокаУИД = СтрПолучитьСтроку(Строки, 3); 
										УИД = Новый УникальныйИдентификатор(СтрокаУИД);									
										Значение = Менеджер.ПолучитьСсылку(УИД);
										ЕстьСсылка = Значение.ПолучитьОбъект();
										
										Если ЕстьСсылка = Неопределено тогда
											///////////////////////////////////////////////////
											Если ВРег(ТипДанных) = ВРег("Документы") тогда
												Запросить = Истина;
												Объект.ОбменДанными.Загрузка = Истина;
												Объект.Проведен = Ложь;
												Объект.Записать(РежимЗаписиДокумента.Запись);  
											Иначе
											///////////////////////////////////////////////////	
												Запросить = Истина;											
												
												Если СтруктураВхПараметров.Свойство("ИНН") и СтруктураВхПараметров.Свойство("КПП") и ЗначениеОбъекта = "Контрагенты" тогда 
													Если ЗначениеЗаполнено(СтруктураВхПараметров.ИНН) тогда
														Контр = НайтиПоИННиКПП(СтруктураВхПараметров.ИНН,СтруктураВхПараметров.КПП);
														Если НЕ Контр = Неопределено тогда
															Значение = Контр;
															Запросить = Ложь;
														КонецЕсли;
													КонецЕсли;
												КонецЕсли;          
												
												Если Запросить и СтруктураВхПараметров.Свойство("VIN") и ЗначениеОбъекта = "Автомобили" тогда
													Если ЗначениеЗаполнено(СтруктураВхПараметров.VIN) тогда
														 Авто = НайтиПоVIN(СтруктураВхПараметров.VIN);
														 Если НЕ Авто = Неопределено тогда
															Значение = Авто;
															Запросить = Ложь;
														КонецЕсли;
													КонецЕсли;
                                                КонецЕсли;
												
												Если Запросить тогда
													НаименованиеСправочника = ЗапроситьПараметр(ТипДанных,ЗначениеОбъекта,СтрокаУИД,"Наименование");
													
													Если НЕ НаименованиеСправочника = Неопределено тогда
		                                            	НайденнаяСсылка = Менеджер.НайтиПоНаименованию(НаименованиеСправочника);
														
														Если ЗначениеЗаполнено(НайденнаяСсылка) тогда
															Запросить = Ложь;
															Значение = НайденнаяСсылка;
														Иначе
															Запросить = Истина;
												    		Объект.ОбменДанными.Загрузка = Истина;
															Объект.Записать(); 
														КонецЕсли;
													КонецЕсли;  
												КонецЕсли;   											
											КонецЕсли;
											///////////////////////////////////////////////////
											Если Запросить тогда																			
												Ответ = ЗапроситьДанныеУИсточника(ТипДанных,ЗначениеОбъекта,СтрокаУИД);
												Если Ответ тогда
													Значение = Менеджер.ПолучитьСсылку(УИД);
												Иначе
													Возврат Неопределено;	
												КонецЕсли; 		
											КонецЕсли;
										КонецЕсли; 
									КонецЕсли;
								КонецЕсли;	           						
							КонецЕсли; 												
							Объект[ЗНЧСтурктуры.Ключ] = Значение;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Объект;		
КонецФункции // ЗаполненыйОбъект() 

Функция ЕстьРеквизитОбъекта(ИмяРеквизита, Объект)

	МетаданныеОбъекта = Объект.Метаданные();
	
	Если НЕ МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		Возврат Истина;			
	КонецЕсли;               
	
	Для Каждого Реквизит из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		Если Реквизит.Имя = ИмяРеквизита тогда
			Возврат Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции 

Функция НайтиПоИННиКПП(ИНН,КПП)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН
		|	И Контрагенты.КПП = &КПП";
	
	Запрос.УстановитьПараметр("ИНН",ИНН);
	Запрос.УстановитьПараметр("КПП",КПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЦикла;
	
	Возврат Неопределено;	
	
КонецФункции // НайтиПоИННиКПП()

Функция НайтиПоVIN(VIN)     
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Автомобили.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Автомобили КАК Автомобили
		|ГДЕ
		|	Автомобили.VIN = &VIN";
	
	Запрос.УстановитьПараметр("VIN", VIN);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЦикла;
	
	Возврат Неопределено;		

КонецФункции // НайтиПоVIN()

Функция ЗапроситьПараметр(ТипОбъекта,ЗначениеОбъекта,УИД,Параметр);
	
	HTTP = Новый HTTPСоединение("kd",,"WS","WS1475369");
	
	//создадим структуру
	тДанные = Новый Структура;
	тДанные.Вставить("УИД",УИД);
	тДанные.Вставить("ТипОбъекта",ТипОбъекта);
	тДанные.Вставить("ЗначениеОбъекта",ЗначениеОбъекта);	
	
	//сериализуем в json
	ЗаписьJSON = Новый ЗаписьJSON;
    тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);  
    ЗаписьJSON.УстановитьСтроку(тПараметрыJSON); 
	
	ЗаписатьJSON(ЗаписьJSON, тДанные); 
	СтрокаJS = ЗаписьJSON.Закрыть();     
	
	//получим временный файл для передачи в теле POST-запроса
    ФайлТелаЗапроса = ПолучитьИмяВременногоФайла(); 
	
	//запишем в файл содержимое тела запроса (текст)
    ТекстФайл = Новый ТекстовыйДокумент;
    ТекстФайл.УстановитьТекст(СтрокаJS);
    ТекстФайл.Записать(ФайлТелаЗапроса, КодировкаТекста.UTF8);
	
	//получим размер данных для передачи в заголовок
    ФайлНаОтправку = Новый Файл(ФайлТелаЗапроса);                                 
	РазмерФайлаНаОтправку = XMLСтрока(ФайлНаОтправку.Размер()); 
	
	//заголовок создадим в виде соответствия
    ЗаголовокЗапросаHTTP = Новый Соответствие();
    //передаем в заголовках размер и тип данных на отправку
    ЗаголовокЗапросаHTTP.Вставить("Content-Length", РазмерФайлаНаОтправку);
    ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	
	//создадим заголовок запроса
	ПутьКБазе = "/Alfa_OptMK/hs/load/";
	URL = ПутьКБазе + Параметр + "/"; 
	ЗапросHTTP = Новый HTTPЗапрос(URL, ЗаголовокЗапросаHTTP);
	
	//загрузить строку в тело                            
	ЗапросHTTP.УстановитьИмяФайлаТела(ФайлТелаЗапроса);
	
	//отсылаем POST-запрос на обработку.
    //ссылкаНаРесурс — ссылка на веб-сервер (страницу), к которой посылается POST
    //запрос
	Попытка
		ОтветHTTP = HTTP.ОтправитьДляОбработки(ЗапросHTTP); 
	Исключение
		Сообщить("Не могу установить соединение с сервером, проверьте интернет и настройки web сервера");
		Возврат Неопределено;
	КонецПопытки; 
	
	Если ОтветHTTP.КодСостояния = 200 тогда
		Результат = ОтветHTTP.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8); 
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;  

КонецФункции // ЗапроситьПараметр(ТипДанных,ЗначениеОбъекта,СтрокаУИД,"Наименование");

Процедура ЗаполнитьСтруктуруОтвета(СтруктураОтвет,КодОтвета,ТекстОшибки,Отработало,ДанныеОтвета)
	СтруктураОтвет.КодОтвета 	= КодОтвета;
	СтруктураОтвет.ТекстОшибки	= ТекстОшибки;
	СтруктураОтвет.Отработало	= Отработало;
	СтруктураОтвет.ДанныеОтвета = ДанныеОтвета;	
КонецПроцедуры 

Функция ЗапроситьДанныеУИсточника(ТипОбъекта,ЗначениеОбъекта,УИД)
	
	HTTP = Новый HTTPСоединение("kd",,"WS","WS1475369");
	
	//создадим структуру
	тДанные = Новый Структура;
	тДанные.Вставить("УИД",УИД);
	тДанные.Вставить("ТипОбъекта",ТипОбъекта);
	тДанные.Вставить("ЗначениеОбъекта",ЗначениеОбъекта);	
	
	//сериализуем в json
	ЗаписьJSON = Новый ЗаписьJSON;
    тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);  
    ЗаписьJSON.УстановитьСтроку(тПараметрыJSON); 
	
	ЗаписатьJSON(ЗаписьJSON, тДанные); 
	СтрокаJS = ЗаписьJSON.Закрыть();     
	
	//получим временный файл для передачи в теле POST-запроса
    ФайлТелаЗапроса = ПолучитьИмяВременногоФайла(); 
	
	//запишем в файл содержимое тела запроса (текст)
    ТекстФайл = Новый ТекстовыйДокумент;
    ТекстФайл.УстановитьТекст(СтрокаJS);
    ТекстФайл.Записать(ФайлТелаЗапроса, КодировкаТекста.UTF8);
	
	//получим размер данных для передачи в заголовок
    ФайлНаОтправку = Новый Файл(ФайлТелаЗапроса);                                 
	РазмерФайлаНаОтправку = XMLСтрока(ФайлНаОтправку.Размер()); 
	
	//заголовок создадим в виде соответствия
    ЗаголовокЗапросаHTTP = Новый Соответствие();
    //передаем в заголовках размер и тип данных на отправку
    ЗаголовокЗапросаHTTP.Вставить("Content-Length", РазмерФайлаНаОтправку);
    ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	
	//создадим заголовок запроса
	ПутьКБазе = "/o2_bro/hs/load/";
	URL = ПутьКБазе + "УИД" + "/"; 
	ЗапросHTTP = Новый HTTPЗапрос(URL, ЗаголовокЗапросаHTTP);
	
	//загрузить строку в тело                            
	ЗапросHTTP.УстановитьИмяФайлаТела(ФайлТелаЗапроса);
	
	//отсылаем POST-запрос на обработку.
    //ссылкаНаРесурс — ссылка на веб-сервер (страницу), к которой посылается POST
    //запрос
	Попытка
		ОтветHTTP = HTTP.ОтправитьДляОбработки(ЗапросHTTP); 
	Исключение
		Сообщить("Не могу установить соединение с сервером, проверьте интернет и настройки web сервера");
		Возврат Ложь;
	КонецПопытки; 
	
	Если ОтветHTTP.КодСостояния = 200 тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 	

КонецФункции // ЗапроситьДанныеУИсточника()

Процедура ОтправитьПоУИДу(СтруктураОтвет,СтруктураВхПараметров)
	
	ВходОбъект = Метаданные[СтруктураВхПараметров.ТипОбъекта];
	Менеджер = Новый(СтрЗаменить(ВходОбъект[СтруктураВхПараметров.ЗначениеОбъекта].ПолноеИмя(), ".","Менеджер."));
	
	СтрокаУИД = СтруктураВхПараметров.УИД;
	УИД = Новый УникальныйИдентификатор(СтрокаУИД);									
	Ссылка = Менеджер.ПолучитьСсылку(УИД);
	
	Ответ = ОтправитьОбъект(Ссылка,УИД);
	
	Если НЕ Ответ Тогда
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,405,"Отсутствует Метод " + ?(СтруктураВхПараметров.ИмяМетода=Неопределено,"",СтруктураВхПараметров.ИмяМетода),ложь,"");
	КонецЕсли;

КонецПроцедуры   

Процедура ОтправитьНаименование(СтруктураОтвет,СтруктураВхПараметров)
	
	ВходОбъект = Метаданные[СтруктураВхПараметров.ТипОбъекта];
	Менеджер = Новый(СтрЗаменить(ВходОбъект[СтруктураВхПараметров.ЗначениеОбъекта].ПолноеИмя(), ".","Менеджер."));
	
	СтрокаУИД = СтруктураВхПараметров.УИД;
	УИД = Новый УникальныйИдентификатор(СтрокаУИД);									
	Ссылка = Менеджер.ПолучитьСсылку(УИД);
    Результат = Ссылка.Наименование;
	СтруктураОтвет.ДанныеОтвета = Результат;	

КонецПроцедуры

Функция ДобавимТаблЧасти(ТаблЧасть)

	СтруктураТЧ = Новый Структура;   
	Если ТипЗнч(ТаблЧасть) = Тип("ТаблицаЗначений") тогда
		ТЧ = ТаблЧасть;
	Иначе
		ТЧ = ТаблЧасть.Выгрузить();	
	КонецЕсли;
	
	СтруктураТЧ.Вставить("КоличествоСтрок",ТЧ.Количество());	
	Для Строка = 0 по ТЧ.Количество() - 1 цикл
		Для Каждого Колонка из ТЧ.Колонки Цикл
			Значение = ТЧ[Строка][Колонка.Имя];
			Если НЕ ТипЗнч(Значение) = Тип("ХранилищеЗначения") и ЗначениеЗаполнено(Значение) тогда
				ПередаваемоеЗначение = Закодировать(Колонка.Имя,Значение);
				СтруктураТЧ.Вставить(Колонка.Имя + "__" + Строка(Строка),ПередаваемоеЗначение);	
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;     
		
	Возврат СтруктураТЧ; 
	
КонецФункции // ДобавимТЧ()

Функция КодироватьРегистр(Регистратор,Регистр)
	
	Если Регистр = "КонтактнаяИнформация" тогда
		Записи = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		Записи.Отбор.Объект.Установить(Регистратор);
		Записи.Прочитать();
		Если Записи.Количество() тогда
			Таблица = Записи.Выгрузить();   
			СтруктураТЧ = ДобавимТаблЧасти(Таблица);   
			Возврат СтруктураТЧ;
		Иначе
			Возврат Неопределено;			
		КонецЕсли;
		
	КонецЕсли;	

КонецФункции // КодироватьРегистр()  

Функция ОтправитьОбъект(Ссылка,УИД) Экспорт 
	
	HTTP = Новый HTTPСоединение("kd",,"WS","WS1475369");
    
	//Делаем запись в регистре, или находим существующую запись по отправке
	Движение = РегистрыСведений.DN_ОбменHTTP.СоздатьНаборЗаписей();
	Движение.Отбор.ОтправляемыйОбъект.Установить(Ссылка);
	Движение.Отбор.Отправлено.Установить(Ложь);
	Движение.Прочитать();
	
	Если Движение.Количество() тогда
		Запись = Движение[0];
	Иначе		
		Запись = Движение.Добавить();
		Запись.ОтправляемыйОбъект = Ссылка;
		Запись.КоличествоПопыток = 0;
	КонецЕсли;
	Движение.Отбор.Отправлено.Использование = Ложь;
	Запись.Период = ТекущаяДата();
	Запись.КоличествоПопыток = Запись.КоличествоПопыток + 1;
	
	//создадим структуру реквизитов объекта
	тДанные = СобратьСтруктуруОбъекта(Ссылка);
	
	ЗначениеОбъекта = Ссылка.Метаданные().Имя;
	тДанные.Вставить("ЗначениеОбъекта",ЗначениеОбъекта);
	тДанные.Вставить("УИД",Строка(УИД)); 

	//Добавим в структуру табличные части объекта
	Для Каждого ТаблЧасть Из Ссылка.Метаданные().ТабличныеЧасти Цикл
		СтруктураТЧ = ДобавимТаблЧасти(Ссылка[ТаблЧасть.Имя]);	
		КодированнаяТЧ = ТаблЧасть.Имя + "_ТаблЧасть";
		тДанные.Вставить(КодированнаяТЧ,СтруктураТЧ);		
	КонецЦикла; 

	//Добавим в структуру записи регистров
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") или ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") тогда
		СтруктураРегистра = КодироватьРегистр(Ссылка,"КонтактнаяИнформация");
		Если НЕ СтруктураРегистра = Неопределено тогда
			КодированРегистр = "КонтактнаяИнформация_РегистрСвед";
			тДанные.Вставить(КодированРегистр,СтруктураРегистра);
		КонецЕсли;   
	КонецЕсли; 
	
	//сериализуем в json
	ЗаписьJSON = Новый ЗаписьJSON;
    тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);  
    ЗаписьJSON.УстановитьСтроку(тПараметрыJSON); 
	
	ЗаписатьJSON(ЗаписьJSON, тДанные); 
	СтрокаJS = ЗаписьJSON.Закрыть();     
	
	//получим временный файл для передачи в теле POST-запроса
    ФайлТелаЗапроса = ПолучитьИмяВременногоФайла(); 
	
	//запишем в файл содержимое тела запроса (текст)
    ТекстФайл = Новый ТекстовыйДокумент;
    ТекстФайл.УстановитьТекст(СтрокаJS);
    ТекстФайл.Записать(ФайлТелаЗапроса, КодировкаТекста.UTF8);
	
	//получим размер данных для передачи в заголовок
    ФайлНаОтправку = Новый Файл(ФайлТелаЗапроса);                                 
	РазмерФайлаНаОтправку = XMLСтрока(ФайлНаОтправку.Размер()); 
	
	//заголовок создадим в виде соответствия
    ЗаголовокЗапросаHTTP = Новый Соответствие();
    //передаем в заголовках размер и тип данных на отправку
    ЗаголовокЗапросаHTTP.Вставить("Content-Length", РазмерФайлаНаОтправку);
    ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	
	//создадим заголовок запроса    
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Ссылка));
	ТипОбъекта = ОпределитьТипОбъекта(ОбъектМетаданных);
		
	ПутьКБазе = "/Alfa_OptMK/hs/load/";
	URL = ПутьКБазе + ТипОбъекта + "/"; 
	ЗапросHTTP = Новый HTTPЗапрос(URL, ЗаголовокЗапросаHTTP);
	
	//загрузить строку в тело                            
	ЗапросHTTP.УстановитьИмяФайлаТела(ФайлТелаЗапроса);
		
	//отсылаем POST-запрос на обработку.
    //ссылкаНаРесурс — ссылка на веб-сервер (страницу), к которой посылается POST
    //запрос
	Попытка
		ОтветHTTP = HTTP.ОтправитьДляОбработки(ЗапросHTTP); 
	Исключение
		Сообщить("Не могу установить соединение с сервером, проверьте интернет и настройки web сервера");
		Запись.Отправлено = Ложь;
		Движение.Записать();
		Возврат Ложь;
	КонецПопытки;
	
	Запись.ОтветПолучен = ТекущаяДата();
		
	Если ОтветHTTP.КодСостояния = 200 тогда
		Запись.Отправлено = Истина;
		Движение.Записать(); 
		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") тогда
			ПередатьПодтверждающиеДокументы(Ссылка);
		КонецЕсли;
	Иначе
		Запись.Отправлено = Ложь;
		Движение.Записать();
		Возврат Ложь;
	КонецЕсли;   
	
	Возврат Истина;
	
КонецФункции

Функция ОпределитьТипОбъекта(ОбъектМетаданных)
	
	ТипОбъекта = "НЕИЗВЕСТНЫЙ";
	
	Если ТипЗнч(ОбъектМетаданных) = Тип("Строка") 
		или ТипЗнч(ОбъектМетаданных) = Тип("Число") тогда
		Возврат ОбъектМетаданных;
	ИначеЕсли ТипЗнч(ОбъектМетаданных) = Тип("Дата") тогда
		ЗначениеДата = "ДАТА__"+Строка(ОбъектМетаданных);
		Возврат ЗначениеДата;
	ИначеЕсли ТипЗнч(ОбъектМетаданных) = Тип("Неопределено") тогда
		Возврат "НЕОПРЕДЕЛЕНО";
	ИначеЕсли ТипЗнч(ОбъектМетаданных) = Тип("Null") тогда
		Возврат "NULL";
	ИначеЕсли ТипЗнч(ОбъектМетаданных) = Тип("Булево") тогда
		Возврат ОбъектМетаданных;
	КонецЕсли;
	
	Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектМетаданных)) тогда
		Для Каждого ЗнчПеречисления из Метаданные.НайтиПоТипу(ТипЗнч(ОбъектМетаданных)).ЗначенияПеречисления цикл
			Если ЗнчПеречисления.Синоним = Строка(ОбъектМетаданных) тогда
				ПеречислениеИмя = ЗнчПеречисления.Имя;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
		ТипОбъекта = "Перечисления__" + Метаданные.НайтиПоТипу(ТипЗнч(ОбъектМетаданных)).Имя + "__" + ПеречислениеИмя;
		Возврат ТипОбъекта;
	ИначеЕсли Метаданные.Справочники.Содержит(ОбъектМетаданных) тогда
		ТипОбъекта = "Справочники";
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) тогда
		ТипОбъекта = "Документы";
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) тогда
		ТипОбъекта = "РегистрыСведений";
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных) тогда
		ТипОбъекта = "РегистрыНакопления";
	КонецЕсли;
	
	Возврат ТипОбъекта;

КонецФункции // ОпределитьТипОбъекта()

Функция СобратьСтруктуруОбъекта(Объект)
	
	СтруктураОбъекта = Новый Структура;
	МетаданныеОбъекта = Объект.Метаданные();
	МассивИменРеквизитов = МассивИменРеквизитовОбъекта(Объект);
		
	Для каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
		Если ЗначениеЗаполнено(Объект[ИмяРеквизита]) и НЕ ТипЗнч(Объект[ИмяРеквизита]) = Тип("ХранилищеЗначения")
			и ЗначениеЗаполнено(Объект[ИмяРеквизита]) тогда
			ПередаваемоеЗначение = Закодировать(ИмяРеквизита,Объект[ИмяРеквизита]);
			СтруктураОбъекта.Вставить(ИмяРеквизита, ПередаваемоеЗначение);
		КонецЕсли;
	КонецЦикла;

	Возврат СтруктураОбъекта;
			 
КонецФункции // СобратьСтруктуруОбъекта()    

Функция Закодировать(Имя, Значение)
	
	ЭтоСсылка = Ложь;
		
	Попытка
		Док = Значение.ПолучитьОбъект();
		ЭтоСсылка = Истина;
	Исключение КонецПопытки;	
	
	Если ЭтоСсылка тогда
		УИД = Значение.УникальныйИдентификатор();
	
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Значение));
		ТипОбъекта = ОпределитьТипОбъекта(ОбъектМетаданных);
		ЗначениеОбъекта = Значение.Метаданные().Имя;
		
		ТекстСсылки = ТипОбъекта + "__" + ЗначениеОбъекта + "__" + Строка(УИД); 
		
		Возврат ТекстСсылки;
		
	Иначе
		НужноеЗначение = ОпределитьТипОбъекта(Значение);
		Возврат НужноеЗначение;
	КонецЕсли;		

КонецФункции // ОпределимЧтоЭто()
                         
Функция МассивИменРеквизитовОбъекта(Объект)

    МассивИменРеквизитов = Новый Массив;

    Если ТипЗнч(Объект) = Тип("ОбъектМетаданных") тогда
        МетаданныеОбъекта = Объект;
    иначе
        МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
        Если МетаданныеОбъекта = Неопределено тогда
            Возврат МассивИменРеквизитов;
        КонецЕсли;
    КонецЕсли;

    Для индекс = 0 по 1 Цикл
        КоллекцияРеквизитов = ?(индекс = 0, МетаданныеОбъекта.СтандартныеРеквизиты, МетаданныеОбъекта.Реквизиты);
        Для Каждого Реквизит Из КоллекцияРеквизитов Цикл
			Если НЕ Реквизит.Имя = "Ссылка" тогда
				Если НЕ Реквизит.Имя = "Предопределенный" тогда 
					МассивИменРеквизитов.Добавить(Реквизит.Имя);
				КонецЕсли;
			КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    Для каждого ОбщийРеквизит Из Метаданные.ОбщиеРеквизиты Цикл
        Если ИспользуетсяОбщийРеквизит(ОбщийРеквизит, МетаданныеОбъекта) тогда
			Если НЕ ОбщийРеквизит.Имя = "Ссылка" тогда
				Если НЕ Реквизит.Имя = "Предопределенный" тогда
					МассивИменРеквизитов.Добавить(Реквизит.Имя);
				КонецЕсли;
			КонецЕсли;
        КонецЕсли;
    КонецЦикла;

    Возврат МассивИменРеквизитов;

КонецФункции    

Функция ИспользуетсяОбщийРеквизит(ОбщийРеквизит, Объект) Экспорт

    Если ТипЗнч(Объект) = Тип("ОбъектМетаданных") тогда
        МетаданныеОбъекта = Объект;
    иначе
        МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
        Если МетаданныеОбъекта = Неопределено тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЕсли;

    Если ТипЗнч(ОбщийРеквизит) = Тип("ОбъектМетаданных") тогда
        МетаданныеОбщегоРеквизита = ОбщийРеквизит;
    иначе
        МетаданныеОбщегоРеквизита = Метаданные.ОбщиеРеквизиты.Найти(ОбщийРеквизит);
        Если МетаданныеОбщегоРеквизита = Неопределено тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЕсли;

    ЭлементСостава = МетаданныеОбщегоРеквизита.Состав.Найти(МетаданныеОбъекта);
    Если ЭлементСостава = Неопределено тогда
        Возврат Ложь;
    КонецЕсли;

    пИспользованиеОбщегоРеквизита = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита;
    Если ЭлементСостава.Использование = пИспользованиеОбщегоРеквизита.Использовать тогда
        Возврат Истина;
    иначеЕсли ЭлементСостава.Использование = пИспользованиеОбщегоРеквизита.НеИспользовать тогда
        Возврат Ложь;
    иначе
        пАвтоИспользованиеОбщегоРеквизита = Метаданные.СвойстваОбъектов.АвтоИспользованиеОбщегоРеквизита;
        Если МетаданныеОбщегоРеквизита.АвтоИспользование = пАвтоИспользованиеОбщегоРеквизита.Использовать тогда
            Возврат Истина;
        иначе
            Возврат Ложь;
        КонецЕсли;
    КонецЕсли;

КонецФункции 

Процедура РегламентОтправки(Ключ) Экспорт 
	
	Движение = РегистрыСведений.DN_ОбменHTTP.СоздатьНаборЗаписей();
	Движение.Отбор.Отправлено.Установить(Ложь);
	Движение.Прочитать();                      
	
	Для Каждого Запись из Движение Цикл
		Ссылка = Запись.ОтправляемыйОбъект;
		УИД = Ссылка.УникальныйИдентификатор();
		Отправлен = ОтправитьОбъект(Ссылка,УИД);		
	КонецЦикла;		
	
КонецПроцедуры
